#Создать список из десяти целых чисел
#Вывести на экран каждое число, увеличенное на 1

my_list = [5, 6, 3, 4, 5, 6, 7, 8, 9, 10]
print('Значения элементов списка, теперь увеличены на 1')
for i in my_list:
    i = i + 1
    print(i)