#Ввести с клавиатуры строку
#Вывести эту строку вертикально: по одному символу на строку консоли

strin_in = input('Введите строку: ')
for letter in strin_in:
    print(letter)